app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @cart = Cart.find(params[:id])

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 26 Feb 2016 07:30:28 UTC +00:00], ["updated_at", Fri, 26 Feb 2016 07:30:28 UTC +00:00]]
---
  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @cart = Cart.find(params[:id])