app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT "products".* FROM "products" ORDER BY title

  def show
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "980190962"]]

  def edit
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "980190962"]]

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "description", "image_url", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "980190962"]]
UPDATE "products" SET "title" = 'Lorem Ipsum', "description" = 'Wibbles are fun!', "image_url" = 'lorem.jpg', "price" = 19.95, "updated_at" = '2016-02-26 01:31:22.027231' WHERE "products"."id" = 980190962

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "980190962"]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 980190962]]